13/data/attachments/5518a9478b3bb4b9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_2e4adcb3-24b2-414a-824e-ea5c243bdce6</nif:username>
            <nif:friendToBeAdded>Shannon_market_Actions_97530_2</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>